# CloudPoint Structure

---
C#Visual BasicVisual C++
Revit 2024 API
---
CloudPoint Structure
Members See Also
---
Represents a point obtained from a Point cloud.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public struct CloudPoint
```

Visual Basic
---
```text
Public Structure CloudPoint
```

Visual C++
---
```text
public value class CloudPoint
```

# See Also
CloudPoint Members
Autodesk.Revit.DB.PointClouds Namespace